# Make sure you have following env variables
# when using this Brewfile or use it with modules/brew.bash
#
  HOMEBREW_CASK_OPTS="--appdir=/Applications"
#  RBENV_ROOT=/usr/local/var/rbenv
#  NVM_DIR=/usr/local/var/nvm

tap "heroku/brew"

brew "git"
brew "heroku"
brew "imagemagick"
brew "nvm"
brew "openssl"
brew "postgresql", restart_service: true
brew "rbenv"
brew "rbenv-default-gems"
brew "readline", link: true
brew "redis", restart_service: true
brew "ruby-build"
brew "ssh-copy-id"
brew "tmux"
brew "watch"
brew "yarn"
brew "z"

cask "chromedriver"
cask "google-chrome"
cask "graphiql"
cask "iterm2"
cask "postman"
cask "slack"
cask "the-unarchiver"
cask "visual-studio-code"
cask "zoom"
cask "sublime-text"
