# Make sure you have following env variables
# when using this Brewfile or use it with modules/brew.bash
#
#  HOMEBREW_CASK_OPTS="--appdir=/Applications"
#  RBENV_ROOT=/usr/local/var/rbenv
#  NVM_DIR=/usr/local/var/nvm

# Essential terminal utilities
tap "homebrew/services"
tap "heroku/brew"

brew "openssl"
brew "readline", link: true

brew "curl"
brew "git"
brew "heroku/brew/heroku"
brew "imagemagick@7", link: true
brew "postgresql"
brew "redis"
brew "ssh-copy-id"
brew "tmux"
brew "watch"
brew "yarn"
brew "z"

# Essential Mac applications
tap "caskroom/cask"
tap "caskroom/versions"

cask "chromedriver"
cask "google-chrome"
cask "iterm2"
cask "java"
cask "phantomjs"
cask "slack"
cask "spectacle"
cask "sublime-text"
cask "the-unarchiver"
cask "zoomus"

# Node version manager
brew "nvm"

# Ruby
brew "rbenv"
brew "ruby-build"
brew "rbenv-default-gems"
