# Make sure you have following env variables
# when using this Brewfile or use it with modules/brew.bash
#
#  HOMEBREW_CASK_OPTS="--appdir=/Applications"
#  RBENV_ROOT=/usr/local/var/rbenv
#  NVM_DIR=/usr/local/var/nvm

# Flatstack Tools
tap "fs/fstool"
brew "fs-tool"

# Essential terminal utilities
tap "homebrew/services"
brew "git"
brew "postgresql"
brew "redis"
brew "imagemagick"
brew "qt"
brew "watch"
brew "z"
brew "ssh-copy-id"
brew "heroku-toolbelt"
brew "tmux"
brew "curl", args: ["with-openssl"]

# Essential Mac applications
tap "caskroom/cask"
tap "caskroom/versions"

cask "java"
cask "iterm2"
cask "the-unarchiver"
cask "slack"
cask "google-chrome"
cask "firefox"
cask "dropbox"
cask "sublime-text"
cask "spectacle"
cask "dash"

# Node version manager
brew "nvm"

# Ruby
brew "rbenv"
brew "ruby-build"
brew "rbenv-default-gems"
